<template>
  <DataTable :value="test">
    <Column field="id" header="Id"></Column>
    <Column field="text" header="Multiline text">
      <template #body="slotProps">
        <div v-for="text in formattedText(slotProps.data.text)" :key="text">
          {{ text }}
        </div>
      </template>
    </Column>
  </DataTable>
</template>
<script setup>
import { ref } from "vue";
import Column from "primevue/column";

const test = ref([
  {
    id: 1,
    text: `[13:36:53] Расчетное время: 9 мин
[13:36:58] Открыть клапан откачки К1
[13:36:58] Включить вакуумный насос
[13:36:58] Закрыть клапан К5
[13:36:58] Закрыть клапан дистилляции К2
[13:36:58] Ожидание: 8 с
[13:37:06] Заливка 2.2мл. в испаритель
[13:37:06] Заданно 26.50602409638554 шагов
[13:37:09] Заливка перекиси завершена
[13:37:09] Открыть клапан дистилляции К2
[13:42:09] Включить нагрев испарителя
[13:42:09] Закрыть клапан дистилляции К2
[13:42:09] конечное давление1.0960040758227925 торр
[13:42:09] Выпаривание через К2
[13:42:09] Выпаривание длилось5 мин
[13:42:09] Откачка до 1 торр
[13:42:15] Закрыть клапан откачки К1
[13:43:09] Открыть клапан откачки К1
[13:43:14] Аппаратное смещение 0 денсит. = -0.313683180809021
[13:43:14] Закрыть клапан дистилляции К2`,
  },
]);

const formattedText = (value) => {
  return value.split(/(?=\[[0-9]{2}:[0-9]{2}:[0-9]{2}\])/);
};
</script>

<!-- <script>
import DataTable from "primevue/datatable";
import Column from "primevue/column";
// import ColumnGroup from "primevue/columngroup"; // optional
// import Row from "primevue/row"; // optional
export default {
  name: "MultilineText",
  components: { DataTable, Column },
  data() {
    return {
      test: [
        {
          id: 1,
          text: `[13:36:53] Расчетное время: 9 мин
[13:36:58] Открыть клапан откачки К1
[13:36:58] Включить вакуумный насос
[13:36:58] Закрыть клапан К5
[13:36:58] Закрыть клапан дистилляции К2
[13:36:58] Ожидание: 8 с
[13:37:06] Заливка 2.2мл. в испаритель
[13:37:06] Заданно 26.50602409638554 шагов
[13:37:09] Заливка перекиси завершена
[13:37:09] Открыть клапан дистилляции К2
[13:42:09] Включить нагрев испарителя
[13:42:09] Закрыть клапан дистилляции К2
[13:42:09] конечное давление1.0960040758227925 торр
[13:42:09] Выпаривание через К2
[13:42:09] Выпаривание длилось5 мин
[13:42:09] Откачка до 1 торр
[13:42:15] Закрыть клапан откачки К1
[13:43:09] Открыть клапан откачки К1
[13:43:14] Аппаратное смещение 0 денсит. = -0.313683180809021
[13:43:14] Закрыть клапан дистилляции К2`,
        },
      ],
      methods: {
        formatText(inputText) {
          return inputText; //inputText.join("/n");
        },
      },
      //   text: [
      //     "[13:36:53] Расчетное время: 9 мин",
      //     "[13:36:58] Открыть клапан откачки К1",
      //     "[13:36:58] Включить вакуумный насос",
      //     "[13:36:58] Закрыть клапан К5",
      //     "[13:36:58] Закрыть клапан дистилляции К2",
      //     "[13:36:58] Ожидание: 8 с",
      //     "[13:37:06] Заливка 2.2мл. в испаритель",
      //     "[13:37:06] Заданно 26.50602409638554 шагов",
      //     "[13:37:09] Заливка перекиси завершена",
      //     "[13:37:09] Открыть клапан дистилляции К2",
      //     "[13:42:09] Включить нагрев испарителя",
      //     "[13:42:09] Закрыть клапан дистилляции К2",
      //     "[13:42:09] конечное давление1.0960040758227925 торр",
      //     "[13:42:09] Выпаривание через К2",
      //     "[13:42:09] Выпаривание длилось5 мин",
      //     "[13:42:09] Откачка до 1 торр",
      //     "[13:42:15] Закрыть клапан откачки К1",
      //     "[13:43:09] Открыть клапан откачки К1",
      //     "[13:43:14] Аппаратное смещение 0 денсит. = -0.313683180809021",
      //     "[13:43:14] Закрыть клапан дистилляции К2",
      //   ],
    };
  },
};
</script> -->

<style></style>
